#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 Success! The configuration is valid.


#### Terraform Plan 📖 `success`

<details open><summary>Show Plan</summary>

```hcl
terraform
spectrocloud_cluster_profile.prodvmware: Refreshing state... [id=600507d8319e5f4bf55eb6f1]
spectrocloud_cluster_profile.vsphere1: Refreshing state... [id=600507d8319e5f4bf87e1ddf]
spectrocloud_cluster_vsphere.prod-vmware-1: Refreshing state... [id=60050c42319e5f4d9bc27d81]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # spectrocloud_cluster_azure.cluster will be created
  + resource "spectrocloud_cluster_azure" "cluster" {
      + cloud_account_id   = "600511e9319e5f50a979c092"
      + cloud_config_id    = (known after apply)
      + cluster_profile_id = (known after apply)
      + id                 = (known after apply)
      + kubeconfig         = (known after apply)
      + name               = "az-picard-1"

      + cloud_config {
          + region          = "westus"
          + resource_group  = "saad-west1"
          + ssh_key         = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDAUaBODDNpQxJJqXz/Q+afauM5EPFp4oDRrWzK/cGd92N+exkd+tEZdO7n3R+WAx0XTcPiVvfKctzekNS6f/ZMrFb5HAPvFJtnGNIE2sm+eryEnAH+Sc7ppZha3/MaSp/A2dm2IobYRvwl04sEi4w1K+I8Rtt+fBe3gV3wnP3E3yOiRx4G2XFC3T6x8MjdOkjO2v6fBluw1M1H2etp1m/n4D70UkeyVJyipcntz0ubHweU7yPNdNS3YkpExYIGhm97C4dyESHEw9PZVdLs1FBL6mW5Yb4qVbg5FkLljLFynh9jL8IAYal0pibAAH+Sk/Nd4865lVJ3lrm8nhBnjs1OEFA487rcxyInxJk/WwLEHvo88Ku9IlYq15Alr8N/JHHackV4kAH0yJNeLtwAysK2gI7Mb5uGnMTPrz73IZqXSxFqnU34Ow+vwu8fXBtXmHA5cUHyz0ARzpgx8A0e8L8SjdY/6dsFhSzGo7JoCElN7sEMo7iI4Wdo8CYdlT+OXizBf3pnM/wxRZclCeRDJpLtd6jl5swv7J5ocINEh1r3BllCyV8L7Xp5gw8IKT3ohz6rliGJwwlq/emqY52eB3wweTLRm30z3h3aQa3YeAR+2JgvWlrJ3YWsYYCLRhSQTfYmpgUkoZIcfB2xkZzp6cyooM0i5Obz313HsxwBHOmNrw== spectro@spectro
            EOT
          + subscription_id = "8710ff2b-e468-434a-9a84-e522999f6b81"
        }

      + machine_pool {
          + control_plane           = false
          + control_plane_as_worker = false
          + count                   = 1
          + instance_type           = "Standard_D2_v3"
          + name                    = "worker-basic"
          + update_strategy         = "RollingUpdateScaleOut"

          + disk {
              + size_gb = (known after apply)
              + type    = (known after apply)
            }
        }
      + machine_pool {
          + control_plane           = true
          + control_plane_as_worker = true
          + count                   = 1
          + instance_type           = "Standard_D2_v3"
          + name                    = "master-pool"
          + update_strategy         = "RollingUpdateScaleOut"

          + disk {
              + size_gb = 65
              + type    = "Standard_LRS"
            }
        }
    }

  # spectrocloud_cluster_profile.azure will be created
  + resource "spectrocloud_cluster_profile" "azure" {
      + cloud       = "azure"
      + description = "basic cp"
      + id          = (known after apply)
      + name        = "ProdAzure"
      + type        = "cluster"

      + pack {
          + name   = "csi-azure"
          + tag    = "1.0.x"
          + uid    = "5fffe6c1042c47556c1ba666"
          + values = <<-EOT
                manifests:
                
                  azure_disk:
                
                    # Azure storage account Sku tier. Default is empty
                    storageaccounttype: "Standard_LRS"
                
                    # Possible values are shared (default), dedicated, and managed
                    kind: "managed"
                
                    #Allowed reclaim policies are Delete, Retain
                    reclaimPolicy: "Delete"
                
                    #Toggle for Volume expansion
                    allowVolumeExpansion: "true"
                
                    #Toggle for Default class
                    isDefaultClass: "true"
                
                    #Supported binding modes are Immediate, WaitForFirstConsumer
                    #Setting binding mode to WaitForFirstConsumer, so that the volumes gets created in the same AZ as that of the pods
                    volumeBindingMode: "WaitForFirstConsumer"
            EOT
        }
      + pack {
          + name   = "cni-calico-azure"
          + tag    = "3.16.x"
          + uid    = "5fffe6c1042c4755466f9b9d"
          + values = <<-EOT
                manifests:
                  calico:
                
                    # IPAM type to use. Supported types are calico-ipam, host-local
                    ipamType: "host-local"
                
                    # Uncomment property below when ipamType is set to calico-ipam
                    # networkCIDR to use (should match the kubernetes podCIDR)
                    #calicoNetworkCIDR: "192.168.0.0/16"
                
                    # Should be one of CALICO_IPV4POOL_IPIP or CALICO_IPV4POOL_VXLAN
                    encapsulationType: "CALICO_IPV4POOL_VXLAN"
                
                    # Should be one of Always, CrossSubnet, Never
                    encapsulationMode: "Always"
                
            EOT
        }
      + pack {
          + name   = "kubernetes"
          + tag    = "1.18.x"
          + uid    = "60050ee341aba93f87b66009"
          + values = <<-EOT
                pack:
                  k8sHardening: True
                  #CIDR Range for Pods in cluster
                  # Note : This must not overlap with any of the host or service network
                  podCIDR: "192.168.0.0/16"
                  #CIDR notation IP range from which to assign service cluster IPs
                  # Note : This must not overlap with any IP ranges assigned to nodes for pods.
                  serviceClusterIpRange: "10.96.0.0/12"
                
                # KubeAdm customization for kubernetes hardening. Below config will be ignored if k8sHardening property above is disabled
                kubeadmconfig:
                  apiServer:
                    extraArgs:
                      anonymous-auth: "true"
                      insecure-port: "0"
                      profiling: "false"
                      disable-admission-plugins: "AlwaysAdmit"
                      default-not-ready-toleration-seconds: "60"
                      default-unreachable-toleration-seconds: "60"
                      enable-admission-plugins: "AlwaysPullImages,NamespaceLifecycle,ServiceAccount,NodeRestriction,PodSecurityPolicy"
                      audit-log-path: /var/log/apiserver/audit.log
                      audit-policy-file: /etc/kubernetes/audit-policy.yaml
                      audit-log-maxage: "30"
                      audit-log-maxbackup: "10"
                      audit-log-maxsize: "100"
                      authorization-mode: RBAC,Node
                      tls-cipher-suites: "TLS_ECDHE_ECDSA_WITH_AES_128_GCM_SHA256,TLS_ECDHE_RSA_WITH_AES_128_GCM_SHA256,TLS_ECDHE_ECDSA_WITH_CHACHA20_POLY1305,TLS_ECDHE_RSA_WITH_AES_256_GCM_SHA384,TLS_ECDHE_RSA_WITH_CHACHA20_POLY1305,TLS_ECDHE_ECDSA_WITH_AES_256_GCM_SHA384,TLS_RSA_WITH_AES_256_GCM_SHA384,TLS_RSA_WITH_AES_128_GCM_SHA256"
                    extraVolumes:
                      - name: audit-log
                        hostPath: /var/log/apiserver
                        mountPath: /var/log/apiserver
                        pathType: DirectoryOrCreate
                      - name: audit-policy
                        hostPath: /etc/kubernetes/audit-policy.yaml
                        mountPath: /etc/kubernetes/audit-policy.yaml
                        readOnly: true
                        pathType: File
                  controllerManager:
                    extraArgs:
                      profiling: "false"
                      terminated-pod-gc-threshold: "25"
                      pod-eviction-timeout: "1m0s"
                      use-service-account-credentials: "true"
                      feature-gates: "RotateKubeletServerCertificate=true"
                      address: "0.0.0.0"
                  scheduler:
                    extraArgs:
                      profiling: "false"
                      address: "0.0.0.0"
                  kubeletExtraArgs:
                    read-only-port : "0"
                    event-qps: "0"
                    feature-gates: "RotateKubeletServerCertificate=true"
                    protect-kernel-defaults: "true"
                    tls-cipher-suites: "TLS_ECDHE_ECDSA_WITH_AES_128_GCM_SHA256,TLS_ECDHE_RSA_WITH_AES_128_GCM_SHA256,TLS_ECDHE_ECDSA_WITH_CHACHA20_POLY1305,TLS_ECDHE_RSA_WITH_AES_256_GCM_SHA384,TLS_ECDHE_RSA_WITH_CHACHA20_POLY1305,TLS_ECDHE_ECDSA_WITH_AES_256_GCM_SHA384,TLS_RSA_WITH_AES_256_GCM_SHA384,TLS_RSA_WITH_AES_128_GCM_SHA256"
                  files:
                    - path: hardening/audit-policy.yaml
                      targetPath: /etc/kubernetes/audit-policy.yaml
                      targetOwner: "root:root"
                      targetPermissions: "0600"
                    - path: hardening/privileged-psp.yaml
                      targetPath: /etc/kubernetes/hardening/privileged-psp.yaml
                      targetOwner: "root:root"
                      targetPermissions: "0600"
                    - path: hardening/90-kubelet.conf
                      targetPath: /etc/sysctl.d/90-kubelet.conf
                      targetOwner: "root:root"
                      targetPermissions: "0600"
                  preKubeadmCommands:
                    # For enabling 'protect-kernel-defaults' flag to kubelet, kernel parameters changes are required
                    - 'echo "====> Applying kernel parameters for Kubelet"'
                    - 'sysctl -p /etc/sysctl.d/90-kubelet.conf'
                  postKubeadmCommands:
                    # Apply the privileged PodSecurityPolicy on the first master node ; Otherwise, CNI (and other) pods won't come up
                    - 'export KUBECONFIG=/etc/kubernetes/admin.conf'
                    # Sometimes api server takes a little longer to respond. Retry if applying the pod-security-policy manifest fails
                    - '[ -f "$KUBECONFIG" ] && { echo " ====> Applying PodSecurityPolicy" ; until $(kubectl apply -f /etc/kubernetes/hardening/privileged-psp.yaml > /dev/null ); do echo "Failed to apply PodSecurityPolicies, will retry in 5s" ; sleep 5 ; done ; } || echo "Skipping PodSecurityPolicy for worker nodes"'
            EOT
        }
      + pack {
          + name   = "ubuntu-azure"
          + tag    = "LTS__18.4.x"
          + uid    = "5fffe6c2042c47567f4d7dec"
          + values = <<-EOT
                
                # Spectro Golden images includes most of the hardening standards recommended by CIS benchmarking v1.5
                
                # Uncomment below section to
                # 1. Include custom files to be copied over to the nodes and/or
                # 2. Execute list of commands before or after kubeadm init/join is executed
                #
                #kubeadmconfig:
                #  preKubeadmCommands:
                #  - echo "Executing pre kube admin config commands"
                #  - update-ca-certificates
                #  - 'systemctl restart containerd; sleep 3'
                #  - 'while [ ! -S /var/run/containerd/containerd.sock ]; do echo "Waiting for containerd..."; sleep 1; done'
                #  postKubeadmCommands:
                #  - echo "Executing post kube admin config commands"
                #  files:
                #  - targetPath: /usr/local/share/ca-certificates/mycom.crt
                #    targetOwner: "root:root"
                #    targetPermissions: "0644"
                #    content: |
                #      -----BEGIN CERTIFICATE-----
                #      MIICyzCCAbOgAwIBAgIBADANBgkqhkiG9w0BAQsFADAVMRMwEQYDVQQDEwprdWJl
                #      cm5ldGVzMB4XDTIwMDkyMjIzNDMyM1oXDTMwMDkyMDIzNDgyM1owFTETMBEGA1UE
                #      AxMKa3ViZXJuZXRlczCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAMdA
                #      nZYs1el/6f9PgV/aO9mzy7MvqaZoFnqO7Qi4LZfYzixLYmMUzi+h8/RLPFIoYLiz
                #      qiDn+P8c9I1uxB6UqGrBt7dkXfjrUZPs0JXEOX9U/6GFXL5C+n3AUlAxNCS5jobN
                #      fbLt7DH3WoT6tLcQefTta2K+9S7zJKcIgLmBlPNDijwcQsbenSwDSlSLkGz8v6N2
                #      7SEYNCV542lbYwn42kbcEq2pzzAaCqa5uEPsR9y+uzUiJpv5tDHUdjbFT8tme3vL
                #      9EdCPODkqtMJtCvz0hqd5SxkfeC2L+ypaiHIxbwbWe7GtliROvz9bClIeGY7gFBK
                #      jZqpLdbBVjo0NZBTJFUCAwEAAaMmMCQwDgYDVR0PAQH/BAQDAgKkMBIGA1UdEwEB
                #      /wQIMAYBAf8CAQAwDQYJKoZIhvcNAQELBQADggEBADIKoE0P+aVJGV9LWGLiOhki
                #      HFv/vPPAQ2MPk02rLjWzCaNrXD7aPPgT/1uDMYMHD36u8rYyf4qPtB8S5REWBM/Y
                #      g8uhnpa/tGsaqO8LOFj6zsInKrsXSbE6YMY6+A8qvv5lPWpJfrcCVEo2zOj7WGoJ
                #      ixi4B3fFNI+wih8/+p4xW+n3fvgqVYHJ3zo8aRLXbXwztp00lXurXUyR8EZxyR+6
                #      b+IDLmHPEGsY9KOZ9VLLPcPhx5FR9njFyXvDKmjUMJJgUpRkmsuU1mCFC+OHhj56
                #      IkLaSJf6z/p2a3YjTxvHNCqFMLbJ2FvJwYCRzsoT2wm2oulnUAMWPI10vdVM+Nc=
                #      -----END CERTIFICATE-----
            EOT
        }
    }

  # spectrocloud_cluster_profile.prodvmware will be updated in-place
  ~ resource "spectrocloud_cluster_profile" "prodvmware" {
        id          = "600507d8319e5f4bf55eb6f1"
        name        = "ProdVMware"
        # (3 unchanged attributes hidden)

      ~ pack {
            name   = "kubernetes"
          ~ uid    = "5fffe6c1042c4755dcee6b02" -> "60050ee341aba93f87b66009"
            # (2 unchanged attributes hidden)
        }
        # (3 unchanged blocks hidden)
    }

  # spectrocloud_cluster_profile.vsphere1 will be updated in-place
  ~ resource "spectrocloud_cluster_profile" "vsphere1" {
        id          = "600507d8319e5f4bf87e1ddf"
        name        = "vsphere-picard-3"
        # (3 unchanged attributes hidden)

      ~ pack {
            name   = "kubernetes"
          ~ uid    = "5fffe6c1042c4755dcee6b02" -> "60050ee341aba93f87b66009"
            # (2 unchanged attributes hidden)
        }
        # (4 unchanged blocks hidden)
    }

  # spectrocloud_cluster_vsphere.prod-vmware-1 will be updated in-place
  ~ resource "spectrocloud_cluster_vsphere" "prod-vmware-1" {
        id                 = "60050c42319e5f4d9bc27d81"
        name               = "vmware-prod-1"
        # (4 unchanged attributes hidden)


      + machine_pool {
          + control_plane           = false
          + control_plane_as_worker = false
          + count                   = 2
          + name                    = "worker-basic"
          + update_strategy         = "RollingUpdateScaleOut"

          + instance_type {
              + cpu          = 4
              + disk_size_gb = 65
              + memory_mb    = 8192
            }

          + placement {
              + cluster   = "cluster1"
              + datastore = "datastore55"
              + network   = "VM Network"
            }
        }
      + machine_pool {
          + control_plane           = true
          + control_plane_as_worker = true
          + count                   = 1
          + name                    = "master-pool"
          + update_strategy         = "RollingUpdateScaleOut"

          + instance_type {
              + cpu          = 2
              + disk_size_gb = 61
              + memory_mb    = 4096
            }

          + placement {
              + cluster   = "cluster1"
              + datastore = "datastore55"
              + network   = "VM Network"
            }
        }
        # (1 unchanged block hidden)
    }

  # spectrocloud_cluster_vsphere.prod-vmware-2 will be created
  + resource "spectrocloud_cluster_vsphere" "prod-vmware-2" {
      + cloud_account_id   = "60021028b8f15e1b049bfaf6"
      + cloud_config_id    = (known after apply)
      + cluster_profile_id = "600507d8319e5f4bf55eb6f1"
      + id                 = (known after apply)
      + kubeconfig         = (known after apply)
      + name               = "vmware-prod-2"

      + cloud_config {
          + datacenter            = "Datacenter"
          + folder                = "Demo/spc-prod-vmware-1"
          + network_search_domain = "spectrocloud.local"
          + network_type          = "DDNS"
          + ssh_key               = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDAUaBODDNpQxJJqXz/Q+afauM5EPFp4oDRrWzK/cGd92N+exkd+tEZdO7n3R+WAx0XTcPiVvfKctzekNS6f/ZMrFb5HAPvFJtnGNIE2sm+eryEnAH+Sc7ppZha3/MaSp/A2dm2IobYRvwl04sEi4w1K+I8Rtt+fBe3gV3wnP3E3yOiRx4G2XFC3T6x8MjdOkjO2v6fBluw1M1H2etp1m/n4D70UkeyVJyipcntz0ubHweU7yPNdNS3YkpExYIGhm97C4dyESHEw9PZVdLs1FBL6mW5Yb4qVbg5FkLljLFynh9jL8IAYal0pibAAH+Sk/Nd4865lVJ3lrm8nhBnjs1OEFA487rcxyInxJk/WwLEHvo88Ku9IlYq15Alr8N/JHHackV4kAH0yJNeLtwAysK2gI7Mb5uGnMTPrz73IZqXSxFqnU34Ow+vwu8fXBtXmHA5cUHyz0ARzpgx8A0e8L8SjdY/6dsFhSzGo7JoCElN7sEMo7iI4Wdo8CYdlT+OXizBf3pnM/wxRZclCeRDJpLtd6jl5swv7J5ocINEh1r3BllCyV8L7Xp5gw8IKT3ohz6rliGJwwlq/emqY52eB3wweTLRm30z3h3aQa3YeAR+2JgvWlrJ3YWsYYCLRhSQTfYmpgUkoZIcfB2xkZzp6cyooM0i5Obz313HsxwBHOmNrw== spectro@spectro
            EOT
        }

      + machine_pool {
          + control_plane           = false
          + control_plane_as_worker = false
          + count                   = 2
          + name                    = "worker-basic"
          + update_strategy         = "RollingUpdateScaleOut"

          + instance_type {
              + cpu          = 4
              + disk_size_gb = 65
              + memory_mb    = 8192
            }

          + placement {
              + cluster   = "cluster1"
              + datastore = "datastore55"
              + network   = "VM Network"
            }
        }
      + machine_pool {
          + control_plane           = true
          + control_plane_as_worker = true
          + count                   = 1
          + name                    = "master-pool"
          + update_strategy         = "RollingUpdateScaleOut"

          + instance_type {
              + cpu          = 2
              + disk_size_gb = 61
              + memory_mb    = 4096
            }

          + placement {
              + cluster   = "cluster1"
              + datastore = "datastore55"
              + network   = "VM Network"
            }
        }
    }

Plan: 3 to add, 3 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>

*Pusher: @saamalik, Action: `pull_request`, Working Directory: `sandbox`, Workflow: `Terraform Plan`*